# -*- coding: utf-8 -*-
"""
Created on Thu Sep  5 16:32:34 2024

@author: lich5
"""
# %% 综合练习

# 1. 创建一个 10x10 的随机矩阵，归一化其所有元素到 0 到 1 之间。


# 2. 创建一个 5x5 的随机矩阵，找到其最大值的索引。


# 3. 创建一个 10x3 的随机矩阵，找出每行的最大值及其索引。


# 4. 创建一个长度为 20 的随机数组，找出其第二大的元素。


# 5. 创建一个 3x3 的随机矩阵，将其转换为仅包含 0 和 1 的矩阵
# （根据某个自定义阈值）。


# 6. 创建一个包含 1000 个元素的数组，将其中的偶数替换为 -1。


# 7. 创建一个 5x5 的随机矩阵，并将其中的奇数行逆序排列。


# 8. 创建一个长度为 10 的数组，查找数组中连续大于 0.5 的元素段。


# 9. 使用 NumPy 计算两个随机数组之间的欧氏距离。


# 10. 生成一个 10x10 的随机矩阵，查找其局部最大值
# （即比周围八个元素都大的值）。

